app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "datafile", "email", "encrypted_password", "gross_revenue", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
      @user = User.new(params[:user])
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
UPDATE "users" SET "datafile" = 'example_input.tab', "encrypted_password" = '7a58c21a42c5a8e64e0e9b4d568c96362fc1e20ee1032fa97f0448859ed36750', "updated_at" = '2012-10-22 09:44:49.725733' WHERE "users"."id" = 1
---
  def update
    # @user = User.find(params[:id])
    # if @user.update_attributes(params[:user])
    #   flash[:success] = "Profile updated."
    #   redirect_to @user
    # else
    #   @title = "Edit user"
    #   render 'edit'
    # end

    @title = "Upload file"
    @user = User.find(params[:id])

    @user.datafile = params[:user][:datafile]
    puts "Read datafile and stored it at #{@user.datafile.current_path}"


    respond_to do |format|
      if @user.update_attribute('datafile', params[:user][:datafile])

INSERT INTO "items" ("created_at", "item_description", "item_price", "merchant_address", "merchant_name", "purchase_count", "purchaser_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
            # Calculates the gross revenue
            @revenue = @revenue + (@item.item_price * @item.purchase_count)

            if !@item.save

SELECT "users".* FROM "users" ORDER BY name LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    # @users = User.paginate(:page => params[:page])
    @users = User.order(:name).page params[:page]